In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                 columns=['col01', 'col02', 'col03'],
                 index=['ind01', 'ind02', 'ind03'])
df

       col01  col02  col03
ind01      1      2      3
ind02      4      5      6
ind03      7      8      9

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                 columns=['col01', 'col02', 'col03'],
                 index=['ind01', 'ind02', 'ind03'])
df

       col01  col02  col03
ind01      1      2      3
ind02      4      5      6
ind03      7      8      9

In [5]:
df.index

Index(['ind01', 'ind02', 'ind03'], dtype='object')

In [6]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [8]:
df = pd.DataFrame({'col01':[1, 2, 3],
                    'col02':[4, 5, 6],
                    'col03':[7, 8, 9]})
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [9]:
df = pd.DataFrame({'col01':[1, 2, 3],
                    'col02':[4, 5, 6],
                    'col03':[7, 8, 9]})
df.index=['ind01', 'ind02', 'ind03']
df

       col01  col02  col03
ind01      1      4      7
ind02      2      5      8
ind03      3      6      9

In [10]:
df = pd.DataFrame({'col01':[1, 2, 3],
                    'col02':[4, 5, 6],
                    'col03':[7, 8, 9]}
                   ,index=['ind01', 'ind02', 'ind03'])
df

       col01  col02  col03
ind01      1      4      7
ind02      2      5      8
ind03      3      6      9

In [12]:
df =pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
df.columns=['col01','col02','col03']
df.index=['ind01','ind02','ind03']
df

       col01  col02  col03
ind01      1      2      3
ind02      4      5      6
ind03      7      8      9

In [14]:
df.columns=['col04','col05','col06']
df

       col04  col05  col06
ind01      1      2      3
ind02      4      5      6
ind03      7      8      9

In [15]:
df= df.rename(columns={'col04':'x'})
df

       x  col05  col06
ind01  1      2      3
ind02  4      5      6
ind03  7      8      9

In [16]:
df= df.rename(columns={'col05':'y','col06':'z'})
df

       x  y  z
ind01  1  2  3
ind02  4  5  6
ind03  7  8  9

In [17]:
df= df.rename(index={'ind01':'w'})
df

       x  y  z
w      1  2  3
ind02  4  5  6
ind03  7  8  9

In [18]:
df['x']

w        1
ind02    4
ind03    7
Name: x, dtype: int64

In [19]:
type(df['x'])

pandas.core.series.Series

In [20]:
df

       x  y  z
w      1  2  3
ind02  4  5  6
ind03  7  8  9

In [21]:
df[['x']]

       x
w      1
ind02  4
ind03  7

In [22]:
type(df[['x']])

pandas.core.frame.DataFrame

In [24]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int64

In [27]:
df = pd.DataFrame({'col01':[1, 2, 3],
                    'col02':[4, 5, 6],
                    'col03':[7, 8, 9]}
                   ,index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [29]:
df.loc['idx01']

col01    1
col02    4
col03    7
Name: idx01, dtype: int64

In [30]:
df.loc['idx01','col02']

4

In [32]:
df.loc[:,'col01']

idx01    1
idx02    2
idx03    3
Name: col01, dtype: int64

In [33]:
df.iloc[:,0]

idx01    1
idx02    2
idx03    3
Name: col01, dtype: int64

In [35]:
df.loc['idx03','col02']

6

In [36]:
df.loc['idx03','col02']=100
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3    100      9

In [37]:
df.loc[:,'col03']=['Tokyo','Osaka','Hokkaido']
df

       col01  col02     col03
idx01      1      4     Tokyo
idx02      2      5     Osaka
idx03      3    100  Hokkaido

In [38]:
df.loc[:,'col02':'col03']

       col02     col03
idx01      4     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [41]:
df.iloc[:,1:3]

       col02     col03
idx01      4     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [42]:
df.index.get_loc('idx03')

2

In [44]:
df.columns.get_loc('col02')

1

In [46]:
df.iloc[df.index.get_loc('idx03'),df.columns.get_loc('col01')]=1000
df

       col01  col02     col03
idx01      1      4     Tokyo
idx02      2      5     Osaka
idx03   1000   1000  Hokkaido

In [47]:
df.dtypes

col01     int64
col02     int64
col03    object
dtype: object

In [48]:
df.shape

(3, 3)

In [49]:
df.T

       idx01  idx02     idx03
col01      1      2      1000
col02      4      5      1000
col03  Tokyo  Osaka  Hokkaido

In [50]:
df = pd.DataFrame({'col01':[1,2,3],'col02':[4,5,6],'col03':[7,8,9]}
                  ,index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [51]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [53]:
df= df.rename(index={'idx03':'idx04'})
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx04      3      6      9

In [55]:
df.loc[:,'col01']

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [56]:
df.iloc[:,0]

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [57]:
df.loc[:,'col01':'col02']

       col01  col02
idx01      1      4
idx02      2      5
idx04      3      6

In [59]:
df.dtypes

col01    int64
col02    int64
col03    int64
dtype: object